src/AccumulationRegisters/КошелькиПерсонажей/КошелькиПерсонажей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КошелькиПерсонажей</name>
  <resources>
    <name>PP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>GP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>EP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>SP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>CP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Персонаж</name>
    <type>
      <types>CatalogRef.Персонажи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/CommonModules/КошелекПерсонажа/Module.bsl
// Серверный модуль предметной логики кошелька персонажа.
//
// Содержит:
//  - чтение физического остатка кошелька из регистра накопления;
//  - пересчёт стоимости произвольного набора монет в медные монеты (CP);
//  - расчёт изменения кошелька при денежном расходе (алгоритм авторазмена);
//  - проверку наличия физических монет для материального расхода.
//
// Источник истины - физические остатки PP/GP/EP/SP/CP в регистре накопления
// КошелькиПерсонажей. Общая стоимость кошелька не хранится отдельным ресурсом
// и всегда вычисляется функционально.
//
// Подавление диагностики BSLLS:
//  Typo-off - "авторазмен" и "авторазмена" являются терминами предметной области
//              (D&D Assistant), зафиксированными в техническом задании.

#Область ПрограммныйИнтерфейс

// Возвращает физический остаток кошелька указанного персонажа.
// Физический состав не нормализуется: если у персонажа лежит 10 SP, функция
// вернёт 10 SP, а не 1 GP.
//
// Параметры:
//  Персонаж - СправочникСсылка.Персонажи
//
// Возвращаемое значение:
//  Структура - описание остатка:
//   * PP       - Число - платиновых монет;
//   * GP       - Число - золотых монет;
//   * EP       - Число - электрумовых монет;
//   * SP       - Число - серебряных монет;
//   * CP       - Число - медных монет;
//   * ВсегоCP  - Число - общая стоимость остатка в медных монетах.
//
Функция ПолучитьОстаток(Персонаж) Экспорт

	Результат = НовыйНаборМонет();

	Если НЕ ЗначениеЗаполнено(Персонаж) Тогда
		Результат.Вставить("ВсегоCP", 0);
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Персонаж", Персонаж);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КошелькиПерсонажейОстатки.PP КАК PP,
	|	КошелькиПерсонажейОстатки.GP КАК GP,
	|	КошелькиПерсонажейОстатки.EP КАК EP,
	|	КошелькиПерсонажейОстатки.SP КАК SP,
	|	КошелькиПерсонажейОстатки.CP КАК CP
	|ИЗ
	|	РегистрНакопления.КошелькиПерсонажей.Остатки(, Персонаж = &Персонаж) КАК КошелькиПерсонажейОстатки";

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.PP = Выборка.PP;
		Результат.GP = Выборка.GP;
		Результат.EP = Выборка.EP;
		Результат.SP = Выборка.SP;
		Результат.CP = Выборка.CP;
	КонецЕсли;

	СтоимостьCP = СтоимостьВCP(
		Результат.PP, Результат.GP, Результат.EP, Результат.SP, Результат.CP);
	Результат.Вставить("ВсегоCP", СтоимостьCP);

	Возврат Результат;

КонецФункции

// Возвращает общую стоимость кошелька персонажа в медных монетах.
//
// Параметры:
//  Персонаж - СправочникСсылка.Персонажи
//
// Возвращаемое значение:
//  Число
//
Функция ПолучитьСтоимостьВCP(Персонаж) Экспорт

	Возврат ПолучитьОстаток(Персонаж).ВсегоCP;

КонецФункции

// Чистая функция: возвращает стоимость набора монет в медных монетах (CP).
//
// Курсы:
//  1 PP = 1000 CP
//  1 GP = 100  CP
//  1 EP = 50   CP
//  1 SP = 10   CP
//  1 CP = 1    CP
//
// Параметры:
//  PP - Число - количество платиновых.
//  GP - Число - количество золотых.
//  EP - Число - количество электрумовых.
//  SP - Число - количество серебряных.
//  CP - Число - количество медных.
//
// Возвращаемое значение:
//  Число
//
//@skip-check bsl-variable-name-invalid
Функция СтоимостьВCP(PP, GP, EP, SP, CP) Экспорт

	Возврат PP * НоминалPP() + GP * НоминалGP() + EP * НоминалEP()
		+ SP * НоминалSP() + CP * НоминалCP();

КонецФункции

// Рассчитывает изменение физического кошелька при денежном расходе.
//
// Алгоритм авторазмена стремится сохранить физический состав кошелька.
// Сначала используются имеющиеся монеты, которыми можно покрыть остаток
// суммы без размена (от крупного номинала к меньшему, не превышая остаток).
// Если покрыть не удается - берется минимальная доступная монета, стоимость
// которой превышает остаток, и выполняется ее размен на монеты следующего
// номинала. Сдача никогда не формируется в EP: правило пункта 8 ТЗ запрещает
// создавать электрумовые монеты при автоматической выдаче сдачи.
//
// Параметры:
//  Остаток - Структура - текущий остаток кошелька (см. ПолучитьОстаток).
//  PP      - Число - количество PP в расходе (>= 0).
//  GP      - Число - количество GP в расходе (>= 0).
//  EP      - Число - количество EP в расходе (>= 0).
//  SP      - Число - количество SP в расходе (>= 0).
//  CP      - Число - количество CP в расходе (>= 0).
//
// Возвращаемое значение:
//  Структура - описание остатка:
//   * PP       - Число - платиновых монет;
//   * GP       - Число - золотых монет;
//   * EP       - Число - электрумовых монет;
//   * SP       - Число - серебряных монет;
//   * CP       - Число - медных монет;
//
//@skip-check bsl-variable-name-invalid
Функция РассчитатьДенежныйРасход(Остаток, PP, GP, EP, SP, CP) Экспорт

	СтоимостьРасхода = СтоимостьВCP(PP, GP, EP, SP, CP);
	СтоимостьКошелька = СтоимостьВCP(
		Остаток.PP, Остаток.GP, Остаток.EP, Остаток.SP, Остаток.CP);

	Если СтоимостьКошелька < СтоимостьРасхода Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Недостаточно средств в кошельке: требуется %1 CP, доступно %2 CP.'"),
			СтоимостьРасхода, СтоимостьКошелька);
	КонецЕсли;

	Если СтоимостьРасхода = 0 Тогда
		Возврат НовыйНаборМонет();
	КонецЕсли;

	ОсталосьОплатить = СтоимостьРасхода;
	ТекущийОстаток = НовыйНаборМонет();
	ТекущийОстаток.PP = Остаток.PP;
	ТекущийОстаток.GP = Остаток.GP;
	ТекущийОстаток.EP = Остаток.EP;
	ТекущийОстаток.SP = Остаток.SP;
	ТекущийОстаток.CP = Остаток.CP;

	Номиналы = НоминалыПоУбыванию();

	Пока ОсталосьОплатить > 0 Цикл

		Если НЕ СписатьПодходящиеМонеты(Номиналы, ТекущийОстаток, ОсталосьОплатить) Тогда
			Если НЕ ВыполнитьРазмен(Номиналы, ТекущийОстаток) Тогда
				ВызватьИсключение НСтр("ru = 'Внутренняя ошибка алгоритма авторазмена: невозможно подобрать монету для оплаты.'");
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

	Изменение = НовыйНаборМонет();
	Изменение.PP = ТекущийОстаток.PP - Остаток.PP;
	Изменение.GP = ТекущийОстаток.GP - Остаток.GP;
	Изменение.EP = ТекущийОстаток.EP - Остаток.EP;
	Изменение.SP = ТекущийОстаток.SP - Остаток.SP;
	Изменение.CP = ТекущийОстаток.CP - Остаток.CP;

	Возврат Изменение;

КонецФункции

// Проверяет, что в физическом остатке кошелька достаточно указанных монет
// для материального расхода. Авторазмен запрещён: каждый номинал списывается
// строго из одноимённого. При нехватке хотя бы одного номинала вызывается
// исключение.
//
// Параметры:
//  Остаток - Структура - текущий остаток кошелька.
//  PP      - Число
//  GP      - Число
//  EP      - Число
//  SP      - Число
//  CP      - Число
//
//@skip-check bsl-variable-name-invalid
Процедура ПроверитьМатериальныйРасход(Остаток, PP, GP, EP, SP, CP) Экспорт

	Ошибки = Новый Массив;
	ДобавитьОшибкуНехватки(Ошибки, "PP", PP, Остаток.PP);
	ДобавитьОшибкуНехватки(Ошибки, "GP", GP, Остаток.GP);
	ДобавитьОшибкуНехватки(Ошибки, "EP", EP, Остаток.EP);
	ДобавитьОшибкуНехватки(Ошибки, "SP", SP, Остаток.SP);
	ДобавитьОшибкуНехватки(Ошибки, "CP", CP, Остаток.CP);

	Если Ошибки.Количество() > 0 Тогда
		ВызватьИсключение СтрСоединить(Ошибки, "; ");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Создаёт пустую структуру с пятью номиналами и нулевыми значениями.
//
//  Структура - описание остатка:
//   * PP       - Число - платиновых монет;
//   * GP       - Число - золотых монет;
//   * EP       - Число - электрумовых монет;
//   * SP       - Число - серебряных монет;
//   * CP       - Число - медных монет;
//
Функция НовыйНаборМонет()

	Набор = Новый Структура;
	Набор.Вставить("PP", 0);
	Набор.Вставить("GP", 0);
	Набор.Вставить("EP", 0);
	Набор.Вставить("SP", 0);
	Набор.Вставить("CP", 0);
	Возврат Набор;

КонецФункции

// Стоимость платиновой монеты в медных монетах.
Функция НоминалPP()
	Возврат 1000;
КонецФункции

// Стоимость золотой монеты в медных монетах.
Функция НоминалGP()
	Возврат 100;
КонецФункции

// Стоимость электрумовой монеты в медных монетах.
Функция НоминалEP()
	Возврат 50;
КонецФункции

// Стоимость серебряной монеты в медных монетах.
Функция НоминалSP()
	Возврат 10;
КонецФункции

// Стоимость медной монеты в медных монетах.
Функция НоминалCP()
	Возврат 1;
КонецФункции

// Количество GP, выдаваемых при размене одной PP.
Функция РазменPP()
	Возврат 10;
КонецФункции

// Количество SP, выдаваемых при размене одной GP.
Функция РазменGP()
	Возврат 10;
КонецФункции

// Количество SP, выдаваемых при размене одной EP.
Функция РазменEP()
	Возврат 5;
КонецФункции

// Количество CP, выдаваемых при размене одной SP.
Функция РазменSP()
	Возврат 10;
КонецФункции

// Возвращает массив номиналов в порядке убывания стоимости в CP.
//
// Возвращаемое значение:
//  Массив из Структура:
//   * Имя     - Строка - имя номинала (PP/GP/EP/SP/CP).
//   * Номинал - Число  - стоимость номинала в CP.
//
//@skip-check SU63 - Массив используется как тип возврата в предметной логике.
//
Функция НоминалыПоУбыванию()

	Ключи = "Имя, Номинал";
	Результат = Новый Массив;
	Результат.Добавить(Новый Структура(Ключи, "PP", НоминалPP()));
	Результат.Добавить(Новый Структура(Ключи, "GP", НоминалGP()));
	Результат.Добавить(Новый Структура(Ключи, "EP", НоминалEP()));
	Результат.Добавить(Новый Структура(Ключи, "SP", НоминалSP()));
	Результат.Добавить(Новый Структура(Ключи, "CP", НоминалCP()));
	Возврат Результат;

КонецФункции

// Пытается списать максимально крупные монеты, не превышая остаток суммы.
// Перебирает номиналы от крупного к мелкому и для первого подходящего
// (стоимость <= остатка и в наличии есть монеты) списывает столько монет,
// сколько можно, не превышая ОсталосьОплатить.
//
// Параметры:
//  Номиналы         - Массив из Структура - список номиналов по убыванию.
//  ТекущийОстаток   - Структура - текущий физический остаток (изменяется).
//  ОсталосьОплатить - Число - сколько ещё нужно оплатить (изменяется).
//
// Возвращаемое значение:
//  Булево - Истина, если удалось списать хотя бы одну монету.
//
Функция СписатьПодходящиеМонеты(Номиналы, ТекущийОстаток, ОсталосьОплатить)

	Для Каждого Ном Из Номиналы Цикл
		Если Ном.Номинал > ОсталосьОплатить Тогда
			Продолжить;
		КонецЕсли;
		Если ТекущийОстаток[Ном.Имя] <= 0 Тогда
			Продолжить;
		КонецЕсли;

		МаксимумМонет = Цел(ОсталосьОплатить / Ном.Номинал);
		СписатьМонет = Мин(ТекущийОстаток[Ном.Имя], МаксимумМонет);

		ТекущийОстаток[Ном.Имя] = ТекущийОстаток[Ном.Имя] - СписатьМонет;
		ОсталосьОплатить = ОсталосьОплатить - СписатьМонет * Ном.Номинал;
		Возврат Истина;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

// Выполняет размен одной монеты на монеты следующего меньшего номинала.
// Выбирается самая мелкая доступная монета, чья стоимость в CP превышает
// ОсталосьОплатить. Размен выполняется по курсам:
//   PP -> 10 GP
//   GP -> 10 SP
//   EP -> 5 SP
//   SP -> 10 CP
// CP разменять нельзя.
//
// Параметры:
//  Номиналы       - Массив Из Структура
//  ТекущийОстаток - Структура - текущий остаток (изменяется).
//  ОсталосьОплатить - Число - оставшаяся к оплате сумма (не изменяется).
//
// Возвращаемое значение:
//  Булево - Истина, если размен выполнен.
//
Функция ВыполнитьРазмен(Номиналы, ТекущийОстаток)

	Кандидат = Неопределено;
	Для Каждого Ном Из Номиналы Цикл
		Если ТекущийОстаток[Ном.Имя] <= 0 Тогда
			Продолжить;
		КонецЕсли;
		// Нам нужен номинал, превышающий остаток суммы - это значит, после
		// предыдущего шага СписатьПодходящиеМонеты не нашёл подходящего.
		// Поэтому ищем любую доступную монету, она заведомо > ОсталосьОплатить.
		Если Кандидат = Неопределено ИЛИ Ном.Номинал < Кандидат.Номинал Тогда
			Кандидат = Ном;
		КонецЕсли;
	КонецЦикла;

	Если Кандидат = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	ТекущийОстаток[Кандидат.Имя] = ТекущийОстаток[Кандидат.Имя] - 1;

	Если Кандидат.Имя = "PP" Тогда
		ТекущийОстаток.GP = ТекущийОстаток.GP + РазменPP();
	ИначеЕсли Кандидат.Имя = "GP" Тогда
		ТекущийОстаток.SP = ТекущийОстаток.SP + РазменGP();
	ИначеЕсли Кандидат.Имя = "EP" Тогда
		ТекущийОстаток.SP = ТекущийОстаток.SP + РазменEP();
	ИначеЕсли Кандидат.Имя = "SP" Тогда
		ТекущийОстаток.CP = ТекущийОстаток.CP + РазменSP();
	Иначе
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;

КонецФункции

Процедура ДобавитьОшибкуНехватки(Ошибки, ИмяНоминала, Требуется, Доступно)

	Если Требуется <= 0 Тогда
		Возврат;
	КонецЕсли;
	Если Доступно >= Требуется Тогда
		Возврат;
	КонецЕсли;

	Ошибки.Добавить(СтрШаблон(
		НСтр("ru = 'Недостаточно %1: требуется %2, доступно %3.'"),
		ИмяНоминала,
		Требуется,
		Доступно));

КонецПроцедуры

#КонецОбласти
